In [1]:
import pandas as pd

#3 Import the required packages with their customary aliases

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

#4A Using the pandas `read_csv()` method, read the GDP dataset into your notebook as a DataFrame called `gdp_df
(this returned an error, corrected my datapath)

In [3]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')

In [4]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7662 entries, 0 to 7661
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  7662 non-null   object
 1   Year             7662 non-null   int64
 2   Value            7662 non-null   float64
 3   Value Footnotes  0 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 239.6+ KB

In [5]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2021  1517.016266              NaN
1     Afghanistan  2020  1968.341002              NaN
2     Afghanistan  2019  2079.921861              NaN
3     Afghanistan  2018  2060.698973              NaN
4     Afghanistan  2017  2096.093111              NaN

In [6]:
gdp_df.tail()

     Country or Area  Year        Value  Value Footnotes
7657        Zimbabwe  1994  2670.106615              NaN
7658        Zimbabwe  1993  2458.783255              NaN
7659        Zimbabwe  1992  2468.278257              NaN
7660        Zimbabwe  1991  2781.787843              NaN
7661        Zimbabwe  1990  2704.757299              NaN

#5 5. How many rows and columns are in `gdp_df`? What are the data types of each column?

In [7]:
gdp_df.shape

(7662, 4)

In [8]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

#6 Drop the `Value Footnotes` column and rename the remaining three to 'Country', 'Year', and 'GDP_Per_Capita'.

In [9]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2021  1517.016266              NaN
1     Afghanistan  2020  1968.341002              NaN
2     Afghanistan  2019  2079.921861              NaN
3     Afghanistan  2018  2060.698973              NaN
4     Afghanistan  2017  2096.093111              NaN

In [10]:
gdp_df = gdp_df.rename(columns = {'Country or Area': 'Country','Value':'GDP_Per_Capita'})
gdp_df.head(4)

       Country  Year  GDP_Per_Capita  Value Footnotes
0  Afghanistan  2021     1517.016266              NaN
1  Afghanistan  2020     1968.341002              NaN
2  Afghanistan  2019     2079.921861              NaN
3  Afghanistan  2018     2060.698973              NaN

In [11]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7662 entries, 0 to 7661
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          7662 non-null   object
 1   Year             7662 non-null   int64
 2   GDP_Per_Capita   7662 non-null   float64
 3   Value Footnotes  0 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 239.6+ KB

#6. How many countries have data for all years? Which countries are missing many years of data? Look at the number of observations per year. What do you notice?

In [12]:
gdp_df['Year'].unique()

array([2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011,
       2010, 2009, 2008, 2007, 2006, 2005, 2004, 2003, 2002, 2022, 2001,
       2000, 1999, 1998, 1997, 1996, 1995, 1994, 1993, 1992, 1991, 1990],
      dtype=int64)

In [13]:
gdp_df['Year'].nunique()

33

In [14]:
year_value_count= gdp_df["Country"].value_counts().reset_index()
year_value_count.head()

                                          index  Country
0  Least developed countries: UN classification       33
1                    Middle East & North Africa       33
2       Middle East & North Africa (IDA & IBRD)       33
3                                 Middle income       33
4                                      Mongolia       33

In [15]:
count_years = len(gdp_df['Year'].value_counts())

print("Years represented?", count_years)
display(gdp_df['Year'].value_counts().sort_index())

Years represented? 33

1990    207
1991    208
1992    210
1993    211
1994    213
1995    223
1996    223
1997    226
1998    226
1999    227
2000    233
2001    234
2002    235
2003    235
2004    236
2005    236
2006    237
2007    237
2008    238
2009    239
2010    239
2011    240
2012    240
2013    242
2014    242
2015    242
2016    242
2017    242
2018    242
2019    242
2020    242
2021    241
2022    232
Name: Year, dtype: int64

#7 Answer: 33 countries have data for all year

In [16]:
count_countries = len(gdp_df['Country'].value_counts())

print("How many countries are represented? {}".format(count_countries))
display(gdp_df['Country'].value_counts().sort_values())

How many countries are represented? 242

Djibouti                     10
Somalia                      10
Turks and Caicos Islands     12
Sint Maarten (Dutch part)    14
Kosovo                       15
                             ..
Puerto Rico                  33
Romania                      33
Russia                       33
Cyprus                       33
Czechia                      33
Name: Country, Length: 242, dtype: int64

#7 Djibouti, Somalia, Turks & Caicos Islands, Sint Maarten and Kosovo are missing years of data

#8 create some plots to show the distribution of GDP per capita for the year 2020

#9 What was the median GDP per capita value in 2020?

In [21]:
gdp_df[gdp_df["Year"]==2020]["GDP_Per_Capita"].median()

13357.997573370474

#12. Which country had the highest GDP per capita in 2020? Create a plot showing how this country's GDP per capita has changed over the timespan of the dataset.

In [22]:
gdp_largest = gdp_df.loc[gdp_df["Year"]==2020]
gdp_largest.nlargest(1,"GDP_Per_Capita")

         Country  Year  GDP_Per_Capita  Value Footnotes
4148  Luxembourg  2020   111751.314751              NaN

#13. Which country had the lowest GDP per capita in 2020? Create a plot showing how this country's GDP per capita has changed over the timespan of the dataset.

In [28]:
gdp_lowest = gdp_df.loc[gdp_df["Year"]==2020]
gdp_lowest.nsmallest(1,"GDP_Per_Capita")

     Country  Year  GDP_Per_Capita  Value Footnotes
973  Burundi  2020      711.355263              NaN

#14 Read in the internet use dataset into a DataFrame named `internet_df`

In [32]:
internet_df = pd.read_csv("../data/internet_use.csv", skiprows=0, nrows = 4495)

In [33]:
internet_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4495 entries, 0 to 4494
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4495 non-null   object
 1   Year             4495 non-null   int64
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 140.6+ KB

In [34]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

In [35]:
internet_df.tail()

     Country or Area  Year     Value  Value Footnotes
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN